specters312/SVD_DUMP/Atmel/ATSAM4LS2C.svd
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <alternateGroup>USART_MODE</alternateGroup>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Usart Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>MODESelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RS485</name>
                  <description>RS485</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDWARE</name>
                  <description>Hardware Handshaking</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODEM</name>
                  <description>Modem</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISO7816_T0</name>
                  <description>IS07816 Protocol: T = 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISO7816_T1</name>
                  <description>IS07816 Protocol: T = 1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRDA</name>
                  <description>IrDA</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LIN_Master</name>
                  <description>LIN Master</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LIN_Slave</name>
                  <description>LIN Slave</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_Master</name>
                  <description>SPI Master</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_Slave</name>
                  <description>SPI Slave</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCLKS</name>
              <description>Clock Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>USCLKSSelect</name>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>MCK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV</name>
                  <description>MCK / DIV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCK</name>
                  <description>SCK</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHRL</name>
              <description>Character Length.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CHRLSelect</name>
                <enumeratedValue>
                  <name>5</name>
                  <description>5 bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>6 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>7 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNC</name>
              <description>Synchronous Mode Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SYNCSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>USART operates in Synchronous Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>USART operates in Asynchronous Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAR</name>
              <description>Parity Type</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>PARSelect</name>
                <enumeratedValue>
                  <name>EVEN</name>
                  <description>Even parity</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODD</name>
                  <description>Odd parity</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPACE</name>
                  <description>Parity forced to 0 (Space)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MARK</name>
                  <description>Parity forced to 1 (Mark)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Parity</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>No Parity</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI</name>
                  <description>Multi-drop mode</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>Multi-drop mode</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBSTOP</name>
              <description>Number of Stop Bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>NBSTOPSelect</name>
                <enumeratedValue>
                  <name>1</name>
                  <description>1 stop bit</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_5</name>
                  <description>1.5 stop bits (Only valid if SYNC=0)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2 stop bits</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHMODE</name>
              <description>Channel Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CHMODESelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECHO</name>
                  <description>Automatic Echo. Receiver input is connected to the TXD pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCAL_LOOP</name>
                  <description>Local Loopback. Transmitter output is connected to the Receiver Input</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REMOTE_LOOP</name>
                  <description>Remote Loopback. RXD pin is internally connected to the TXD pin</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSBF</name>
              <description>Bit Order</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MSBFSelect</name>
                <enumeratedValue>
                  <name>LSBF</name>
                  <description>Least Significant Bit first</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSBF</name>
                  <description>Most Significant Bit first</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE9</name>
              <description>9-bit Character Length</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MODE9Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>CHRL defines character length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>9-bit character length</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKO</name>
              <description>Clock Output Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CLKOSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The USART does not drive the SCK pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The USART drives the SCK pin if USCLKS does not select the external clock SCK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVER</name>
              <description>Oversampling Mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OVERSelect</name>
                <enumeratedValue>
                  <name>X16</name>
                  <description>16x Oversampling</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X8</name>
                  <description>8x Oversampling</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INACK</name>
              <description>Inhibit Non Acknowledge</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>INACKSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The NACK is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The NACK is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSNACK</name>
              <description>Disable Successive NACK</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DSNACKSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>NACK is sent on the ISO line as soon as a parity error occurs in the received character (unless INACK is set)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Successive parity errors are counted up to the value specified in the MAX_ITERATION field. These parity errors generatea NACK on the ISO line. As soon as this value is reached, no additional NACK is sent on the ISO line. The flag ITERATION is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VAR_SYNC</name>
              <description>Variable synchronization of command/data sync Start Frame Delimiter</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>VAR_SYNCSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>User defined configuration of command or data sync field depending on SYNC value</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The sync field is updated when a character is written into THR register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVDATA</name>
              <description>Inverted data</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MAX_ITERATION</name>
              <description>Max interation</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FILTER</name>
              <description>Infrared Receive Line Filter</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FILTERSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The USART does not filter the receive line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The USART filters the receive line using a three-sample filter (1/16-bit clock) (2 over 3 majority)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAN</name>
              <description>Manchester Encoder/Decoder Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MANSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Manchester Encoder/Decoder is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Manchester Encoder/Decoder is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODSYNC</name>
              <description>Manchester Synchronization Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MODSYNCSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The Manchester Start bit is a 0 to 1 transition</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The Manchester Start bit is a 1 to 0 transition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONEBIT</name>
              <description>Start Frame Delimiter selector</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ONEBITSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Start Frame delimiter is COMMAND or DATA SYNC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Start Frame delimiter is One Bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NER</name>
          <description>Number of Errors Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NB_ERRORS</name>
              <description>Error number during ISO7816 transfers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RHR</name>
          <description>Receiver Holding Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXCHR</name>
              <description>Received Character</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>RXSYNH</name>
              <description>Received Sync</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RXSYNHSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Last character received is a Data</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Last character received is a Command</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTOR</name>
          <description>Receiver Time-out Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TO</name>
              <description>Time-out Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <enumeratedValues>
                <name>TOSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables the RX Time-out function</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>THR</name>
          <description>Transmitter Holding Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXCHR</name>
              <description>Character to be Transmitted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>TXSYNH</name>
              <description>Sync Field to be transmitted</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TXSYNHSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The next character sent is encoded as a data. Start Frame Delimiter is DATA SYNC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The next character sent is encoded as a command. Start Frame Delimiter is COMMAND SYNC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TTGR</name>
          <description>Transmitter Timeguard Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TG</name>
              <description>Timeguard Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>TGSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables the TX Timeguard function.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
